//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// int num = new Random().Next(100, 1000);
// Console.WriteLine($"Наше число: {num}");
// Console.WriteLine($"Наша 2ая цифра числа: {(num - (num / 100) * 100 - num % 10) / 10}");




//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// int num = Convert.ToInt32(Console.ReadLine());
// if (num/100 > 0) 
// {
//     Console.WriteLine($"Третья цифра: {num.ToString()[2]}");
// }
// else
// {
//     Console.WriteLine("Третьей цифры нет");
// }





// // Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// bool Day(int number)
// {
//     return (number > 5 && number < 8);
// }
// Console.WriteLine(Day(15));







